Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART2_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    return LPUART_NonBlockingPowerControl(state, &LPUART2_NonBlockingDriverState);
}

static int32_t LPUART2_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART2_NonBlockingDriverState);
}

static int32_t LPUART2_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART2_NonBlockingDriverState);
}

static int32_t LPUART2_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART2_NonBlockingDriverState);
}

static uint32_t LPUART2_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART2_NonBlockingDriverState);
}

static uint32_t LPUART2_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART2_NonBlockingDriverState);
}

static int32_t LPUART2_NonBlockingControl(uint32_t control, uint32_t arg)
{
    return LPUART_NonBlockingControl(control, arg, &LPUART2_NonBlockingDriverState);
}

static ARM_USART_STATUS LPUART2_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART2_NonBlockingDriverState);
}

/* LPUART2 Driver Control Block */
ARM_DRIVER_USART LPUART2_NonBlocking_Driver = {LPUARTx_GetVersion,
                                               LPUARTx_GetCapabilities,
                                               LPUART2_NonBlockingInitialize,
                                               LPUART2_NonBlockingUninitialize,
                                               LPUART2_NonBlockingPowerControl,
                                               LPUART2_NonBlockingSend,
                                               LPUART2_NonBlockingReceive,
                                               LPUART2_NonBlockingTransfer,
                                               LPUART2_NonBlockingGetTxCount,
                                               LPUART2_NonBlockingGetRxCount,
                                               LPUART2_NonBlockingControl,
                                               LPUART2_NonBlockingGetStatus,
                                               LPUARTx_SetModemControl,
                                               LPUARTx_GetModemStatus};

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_lpuart_dma_resource_t LPUART2_DmaResource = {
    RTE_LPUART2_DMA_TX_DMA_BASE, RTE_LPUART2_DMA_TX_CH, RTE_LPUART2_DMA_TX_DMAMUX_BASE, RTE_LPUART2_DMA_TX_PERI_SEL,

    RTE_LPUART2_DMA_RX_DMA_BASE, RTE_LPUART2_DMA_RX_CH, RTE_LPUART2_DMA_RX_DMAMUX_BASE, RTE_LPUART2_DMA_RX_PERI_SEL,
};

lpuart_dma_handle_t LPUART2_DmaHandle;
dma_handle_t LPUART2_DmaRxHandle;
dma_handle_t LPUART2_DmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("lpuart2_dma_driver_state")
cmsis_lpuart_dma_driver_state_t LPUART2_DmaDriverState = {
#else
cmsis_lpuart_dma_driver_state_t LPUART2_DmaDriverState = {
#endif
    &LPUART2_Resource, &LPUART2_DmaResource, &LPUART2_DmaHandle, &LPUART2_DmaRxHandle, &LPUART2_DmaTxHandle,
};

static int32_t LPUART2_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    LPUART2_InitPins();
    return LPUART_DmaInitialize(cb_event, &LPUART2_DmaDriverState);
}

static int32_t LPUART2_DmaUninitialize(void)
{
    LPUART2_DeinitPins();
    return LPUART_DmaUninitialize(&LPUART2_DmaDriverState);
}

static int32_t LPUART2_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART2_DmaDriverState);
}

static int32_t LPUART2_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART2_DmaDriverState);
}

static int32_t LPUART2_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART2_DmaDriverState);
}

static int32_t LPUART2_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART2_DmaDriverState);
}

static uint32_t LPUART2_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART2_DmaDriverState);
}

static uint32_t LPUART2_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART2_DmaDriverState);
}

static int32_t LPUART2_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART2_DmaDriverState);
}

static ARM_USART_STATUS LPUART2_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART2_DmaDriverState);
}

/* LPUART2 Driver Control Block */
ARM_DRIVER_USART LPUART2_Dma_Driver = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities, LPUART2_DmaInitialize,
                                       LPUART2_DmaUninitialize, LPUART2_DmaPowerControl, LPUART2_DmaSend,
                                       LPUART2_DmaReceive,      LPUART2_DmaTransfer,     LPUART2_DmaGetTxCount,
                                       LPUART2_DmaGetRxCount,   LPUART2_DmaControl,      LPUART2_DmaGetStatus,
                                       LPUARTx_SetModemControl, LPUARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_DMA_COUNT */

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

cmsis_lpuart_edma_resource_t LPUART2_EdmaResource = {
    RTE_LPUART2_DMA_TX_DMA_BASE, RTE_LPUART2_DMA_TX_CH, RTE_LPUART2_DMA_TX_DMAMUX_BASE, RTE_LPUART2_DMA_TX_PERI_SEL,

    RTE_LPUART2_DMA_RX_DMA_BASE, RTE_LPUART2_DMA_RX_CH, RTE_LPUART2_DMA_RX_DMAMUX_BASE, RTE_LPUART2_DMA_RX_PERI_SEL,
};

lpuart_edma_handle_t LPUART2_EdmaHandle;
edma_handle_t LPUART2_EdmaRxHandle;
edma_handle_t LPUART2_EdmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("lpuart2_edma_driver_state")
cmsis_lpuart_edma_driver_state_t LPUART2_EdmaDriverState = {
#else
cmsis_lpuart_edma_driver_state_t LPUART2_EdmaDriverState = {
#endif
    &LPUART2_Resource, &LPUART2_EdmaResource, &LPUART2_EdmaHandle, &LPUART2_EdmaRxHandle, &LPUART2_EdmaTxHandle,
};

static int32_t LPUART2_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    LPUART2_InitPins();
    return LPUART_EdmaInitialize(cb_event, &LPUART2_EdmaDriverState);
}

