Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART4_NonBlockingControl(uint32_t control, uint32_t arg)
{
    return LPUART_NonBlockingControl(control, arg, &LPUART4_NonBlockingDriverState);
}

static ARM_USART_STATUS LPUART4_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART4_NonBlockingDriverState);
}

/* LPUART4 Driver Control Block */
ARM_DRIVER_USART LPUART4_NonBlocking_Driver = {LPUARTx_GetVersion,
                                               LPUARTx_GetCapabilities,
                                               LPUART4_NonBlockingInitialize,
                                               LPUART4_NonBlockingUninitialize,
                                               LPUART4_NonBlockingPowerControl,
                                               LPUART4_NonBlockingSend,
                                               LPUART4_NonBlockingReceive,
                                               LPUART4_NonBlockingTransfer,
                                               LPUART4_NonBlockingGetTxCount,
                                               LPUART4_NonBlockingGetRxCount,
                                               LPUART4_NonBlockingControl,
                                               LPUART4_NonBlockingGetStatus,
                                               LPUARTx_SetModemControl,
                                               LPUARTx_GetModemStatus};

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_lpuart_dma_resource_t LPUART4_DmaResource = {
    RTE_LPUART4_DMA_TX_DMA_BASE, RTE_LPUART4_DMA_TX_CH, RTE_LPUART4_DMA_TX_DMAMUX_BASE, RTE_LPUART4_DMA_TX_PERI_SEL,

    RTE_LPUART4_DMA_RX_DMA_BASE, RTE_LPUART4_DMA_RX_CH, RTE_LPUART4_DMA_RX_DMAMUX_BASE, RTE_LPUART4_DMA_RX_PERI_SEL,
};

lpuart_dma_handle_t LPUART4_DmaHandle;
dma_handle_t LPUART4_DmaRxHandle;
dma_handle_t LPUART4_DmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("lpuart4_dma_driver_state")
cmsis_lpuart_dma_driver_state_t LPUART4_DmaDriverState = {
#else
cmsis_lpuart_dma_driver_state_t LPUART4_DmaDriverState = {
#endif
    &LPUART4_Resource, &LPUART4_DmaResource, &LPUART4_DmaHandle, &LPUART4_DmaRxHandle, &LPUART4_DmaTxHandle};

static int32_t LPUART4_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    LPUART4_InitPins();
    return LPUART_DmaInitialize(cb_event, &LPUART4_DmaDriverState);
}

static int32_t LPUART4_DmaUninitialize(void)
{
    LPUART4_DeinitPins();
    return LPUART_DmaUninitialize(&LPUART4_DmaDriverState);
}

static int32_t LPUART4_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART4_DmaDriverState);
}

static int32_t LPUART4_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART4_DmaDriverState);
}

static int32_t LPUART4_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART4_DmaDriverState);
}

static int32_t LPUART4_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART4_DmaDriverState);
}

static uint32_t LPUART4_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART4_DmaDriverState);
}

static uint32_t LPUART4_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART4_DmaDriverState);
}

static int32_t LPUART4_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART4_DmaDriverState);
}

static ARM_USART_STATUS LPUART4_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART4_DmaDriverState);
}

/* LPUART4 Driver Control Block */
ARM_DRIVER_USART LPUART4_Dma_Driver = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities, LPUART4_DmaInitialize,
                                       LPUART4_DmaUninitialize, LPUART4_DmaPowerControl, LPUART4_DmaSend,
                                       LPUART4_DmaReceive,      LPUART4_DmaTransfer,     LPUART4_DmaGetTxCount,
                                       LPUART4_DmaGetRxCount,   LPUART4_DmaControl,      LPUART4_DmaGetStatus,
                                       LPUARTx_SetModemControl, LPUARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_DMA_COUNT */

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

cmsis_lpuart_edma_resource_t LPUART4_EdmaResource = {
    RTE_LPUART4_DMA_TX_DMA_BASE, RTE_LPUART4_DMA_TX_CH, RTE_LPUART4_DMA_TX_DMAMUX_BASE, RTE_LPUART4_DMA_TX_PERI_SEL,

    RTE_LPUART4_DMA_RX_DMA_BASE, RTE_LPUART4_DMA_RX_CH, RTE_LPUART4_DMA_RX_DMAMUX_BASE, RTE_LPUART4_DMA_RX_PERI_SEL,
};

lpuart_edma_handle_t LPUART4_EdmaHandle;
edma_handle_t LPUART4_EdmaRxHandle;
edma_handle_t LPUART4_EdmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("lpuart4_edma_driver_state")
cmsis_lpuart_edma_driver_state_t LPUART4_EdmaDriverState = {
#else
cmsis_lpuart_edma_driver_state_t LPUART4_EdmaDriverState = {
#endif
    &LPUART4_Resource, &LPUART4_EdmaResource, &LPUART4_EdmaHandle, &LPUART4_EdmaRxHandle, &LPUART4_EdmaTxHandle};

static int32_t LPUART4_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    LPUART4_InitPins();
    return LPUART_EdmaInitialize(cb_event, &LPUART4_EdmaDriverState);
}

static int32_t LPUART4_EdmaUninitialize(void)
{
    LPUART4_DeinitPins();
    return LPUART_EdmaUninitialize(&LPUART4_EdmaDriverState);
}

static int32_t LPUART4_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART4_EdmaDriverState);
}

static int32_t LPUART4_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART4_EdmaDriverState);
}

static int32_t LPUART4_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART4_EdmaDriverState);
}

static int32_t LPUART4_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART4_EdmaDriverState);
}

static uint32_t LPUART4_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART4_EdmaDriverState);
}

static uint32_t LPUART4_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART4_EdmaDriverState);
}

static int32_t LPUART4_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART4_EdmaDriverState);
}

static ARM_USART_STATUS LPUART4_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART4_EdmaDriverState);
}

