Masmiseim36/nxpSDK/devices/MK65F18/cmsis_drivers/fsl_lpuart_cmsis.c
/* LPUART4 Driver Control Block */
ARM_DRIVER_USART LPUART4_Edma_Driver = {LPUARTx_GetVersion,       LPUARTx_GetCapabilities,  LPUART4_EdmaInitialize,
                                        LPUART4_EdmaUninitialize, LPUART4_EdmaPowerControl, LPUART4_EdmaSend,
                                        LPUART4_EdmaReceive,      LPUART4_EdmaTransfer,     LPUART4_EdmaGetTxCount,
                                        LPUART4_EdmaGetRxCount,   LPUART4_EdmaControl,      LPUART4_EdmaGetStatus,
                                        LPUARTx_SetModemControl,  LPUARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */

#endif /* LPUART4 */

#if defined(LPUART5)

extern uint32_t LPUART5_GetFreq(void);
extern void LPUART5_InitPins(void);
extern void LPUART5_DeinitPins(void);

cmsis_lpuart_resource_t LPUART5_Resource = {LPUART5, LPUART5_GetFreq};

lpuart_handle_t LPUART5_Handle;

#if defined(__CC_ARM)
ARMCC_SECTION("lpuart5_non_blocking_driver_state")
cmsis_lpuart_non_blocking_driver_state_t LPUART5_NonBlockingDriverState = {
#else
cmsis_lpuart_non_blocking_driver_state_t LPUART5_NonBlockingDriverState = {
#endif
    &LPUART5_Resource, &LPUART5_Handle,
};

static int32_t LPUART5_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    LPUART5_InitPins();
    return LPUART_NonBlockingInitialize(cb_event, &LPUART5_NonBlockingDriverState);
}

static int32_t LPUART5_NonBlockingUninitialize(void)
{
    LPUART5_DeinitPins();
    return LPUART_NonBlockingUninitialize(&LPUART5_NonBlockingDriverState);
}

static int32_t LPUART5_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    return LPUART_NonBlockingPowerControl(state, &LPUART5_NonBlockingDriverState);
}

static int32_t LPUART5_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART5_NonBlockingDriverState);
}

static int32_t LPUART5_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART5_NonBlockingDriverState);
}

static int32_t LPUART5_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART5_NonBlockingDriverState);
}

static uint32_t LPUART5_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART5_NonBlockingDriverState);
}

static uint32_t LPUART5_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART5_NonBlockingDriverState);
}

static int32_t LPUART5_NonBlockingControl(uint32_t control, uint32_t arg)
{
    return LPUART_NonBlockingControl(control, arg, &LPUART5_NonBlockingDriverState);
}

static ARM_USART_STATUS LPUART5_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART5_NonBlockingDriverState);
}

/* LPUART5 Driver Control Block */
ARM_DRIVER_USART LPUART5_NonBlocking_Driver = {LPUARTx_GetVersion,
                                               LPUARTx_GetCapabilities,
                                               LPUART5_NonBlockingInitialize,
                                               LPUART5_NonBlockingUninitialize,
                                               LPUART5_NonBlockingPowerControl,
                                               LPUART5_NonBlockingSend,
                                               LPUART5_NonBlockingReceive,
                                               LPUART5_NonBlockingTransfer,
                                               LPUART5_NonBlockingGetTxCount,
                                               LPUART5_NonBlockingGetRxCount,
                                               LPUART5_NonBlockingControl,
                                               LPUART5_NonBlockingGetStatus,
                                               LPUARTx_SetModemControl,
                                               LPUARTx_GetModemStatus};

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_lpuart_dma_resource_t LPUART5_DmaResource = {
    RTE_LPUART5_DMA_TX_DMA_BASE, RTE_LPUART5_DMA_TX_CH, RTE_LPUART5_DMA_TX_DMAMUX_BASE, RTE_LPUART5_DMA_TX_PERI_SEL,

    RTE_LPUART5_DMA_RX_DMA_BASE, RTE_LPUART5_DMA_RX_CH, RTE_LPUART5_DMA_RX_DMAMUX_BASE, RTE_LPUART5_DMA_RX_PERI_SEL,
};

lpuart_dma_handle_t LPUART5_DmaHandle;
dma_handle_t LPUART5_DmaRxHandle;
dma_handle_t LPUART5_DmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("lpuart5_dma_driver_state")
cmsis_lpuart_dma_driver_state_t LPUART5_DmaDriverState = {
#else
cmsis_lpuart_dma_driver_state_t LPUART5_DmaDriverState = {
#endif
    &LPUART5_Resource, &LPUART5_DmaResource, &LPUART5_DmaHandle, &LPUART5_DmaRxHandle, &LPUART5_DmaTxHandle,
};

static int32_t LPUART5_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    LPUART5_InitPins();
    return LPUART_DmaInitialize(cb_event, &LPUART5_DmaDriverState);
}

static int32_t LPUART5_DmaUninitialize(void)
{
    LPUART5_DeinitPins();
    return LPUART_DmaUninitialize(&LPUART5_DmaDriverState);
}

static int32_t LPUART5_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART5_DmaDriverState);
}

static int32_t LPUART5_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART5_DmaDriverState);
}

static int32_t LPUART5_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART5_DmaDriverState);
}

static int32_t LPUART5_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART5_DmaDriverState);
}

static uint32_t LPUART5_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART5_DmaDriverState);
}

static uint32_t LPUART5_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART5_DmaDriverState);
}

static int32_t LPUART5_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART5_DmaDriverState);
}

static ARM_USART_STATUS LPUART5_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART5_DmaDriverState);
}

/* LPUART5 Driver Control Block */
ARM_DRIVER_USART LPUART5_Dma_Driver = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities, LPUART5_DmaInitialize,
                                       LPUART5_DmaUninitialize, LPUART5_DmaPowerControl, LPUART5_DmaSend,
                                       LPUART5_DmaReceive,      LPUART5_DmaTransfer,     LPUART5_DmaGetTxCount,
                                       LPUART5_DmaGetRxCount,   LPUART5_DmaControl,      LPUART5_DmaGetStatus,
                                       LPUARTx_SetModemControl, LPUARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_DMA_COUNT */

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

cmsis_lpuart_edma_resource_t LPUART5_EdmaResource = {
    RTE_LPUART5_DMA_TX_DMA_BASE, RTE_LPUART5_DMA_TX_CH, RTE_LPUART5_DMA_TX_DMAMUX_BASE, RTE_LPUART5_DMA_TX_PERI_SEL,

    RTE_LPUART5_DMA_RX_DMA_BASE, RTE_LPUART5_DMA_RX_CH, RTE_LPUART5_DMA_RX_DMAMUX_BASE, RTE_LPUART5_DMA_RX_PERI_SEL,
};

lpuart_edma_handle_t LPUART5_EdmaHandle;
edma_handle_t LPUART5_EdmaRxHandle;
edma_handle_t LPUART5_EdmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("lpuart5_edma_driver_state")
cmsis_lpuart_edma_driver_state_t LPUART5_EdmaDriverState = {
#else
cmsis_lpuart_edma_driver_state_t LPUART5_EdmaDriverState = {
#endif
    &LPUART5_Resource, &LPUART5_EdmaResource, &LPUART5_EdmaHandle, &LPUART5_EdmaRxHandle, &LPUART5_EdmaTxHandle,
};

static int32_t LPUART5_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    LPUART5_InitPins();
    return LPUART_EdmaInitialize(cb_event, &LPUART5_EdmaDriverState);
}

static int32_t LPUART5_EdmaUninitialize(void)
{
    LPUART5_DeinitPins();
    return LPUART_EdmaUninitialize(&LPUART5_EdmaDriverState);
}

static int32_t LPUART5_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART5_EdmaDriverState);
}

static int32_t LPUART5_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART5_EdmaDriverState);
}

static int32_t LPUART5_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART5_EdmaDriverState);
}

static int32_t LPUART5_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART5_EdmaDriverState);
}

static uint32_t LPUART5_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART5_EdmaDriverState);
}

static uint32_t LPUART5_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART5_EdmaDriverState);
}

static int32_t LPUART5_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART5_EdmaDriverState);
}

static ARM_USART_STATUS LPUART5_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART5_EdmaDriverState);
}

/* LPUART5 Driver Control Block */
ARM_DRIVER_USART LPUART5_Edma_Driver = {LPUARTx_GetVersion,       LPUARTx_GetCapabilities,  LPUART5_EdmaInitialize,
                                        LPUART5_EdmaUninitialize, LPUART5_EdmaPowerControl, LPUART5_EdmaSend,
                                        LPUART5_EdmaReceive,      LPUART5_EdmaTransfer,     LPUART5_EdmaGetTxCount,
                                        LPUART5_EdmaGetRxCount,   LPUART5_EdmaControl,      LPUART5_EdmaGetStatus,
                                        LPUARTx_SetModemControl,  LPUARTx_GetModemStatus};
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */

#endif /* LPUART5 */
